Tekla.Structures.Datatype.DistanceConverter
The DistanceConverter class converts types to and from the distance type.

Tekla.Structures.Datatype.DistanceConverter.CanConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Type)
Checks whether the conversion can be made from the source type to the distance type.
context: The context.
sourceType: The type to convert from.
Returns: True if possible, false if not possible.

Tekla.Structures.Datatype.DistanceConverter.CanConvertTo(System.ComponentModel.ITypeDescriptorContext,System.Type)
Checks whether the conversion can be made from the distance type to the destination type.
context: The context.
destinationType: The type to convert to.
Returns: True if possible, false if not possible.

Tekla.Structures.Datatype.DistanceConverter.ConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object)
Converts an object from the given culture to the distance type.
context: The context.
culture: The culture.
value: The object to be converted.
Returns: The new distance object.

Tekla.Structures.Datatype.DistanceConverter.ConvertTo(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object,System.Type)
Converts an object from the distance type to the given destination type.
context: The context.
culture: The target culture.
value: The distance object to be converted.
destinationType: The destination type.
Returns: The given distance object converted to the new type.